using Microsoft.AspNetCore.Mvc;
using System.Collections.Generic;

namespace PizzaApp.Repositories
{
    public class PizzaRepository
    {
        public List<object> GetAllPizzas()
        {
            return new List<object>
            {
new {
    name = "Новогодняя",
    image = "../img/novogodnyaya_2s.jpg",
    composition = new []{ "Соус \"Гавайский\"", "Сыр моцарелла", "Куриная грудка", "Мандарины консервированные", "Стружка миндаля", "Кокосовая стружка" },
    sizes = new []{ "30 см", "40 см", "60 см" },
    crust = "Традиционное Толстое",
    price = 550m,
    weight = "670g"
},
new {
    name = "Capriccio",
    image = "../img/capriccio_2s.jpg",
    composition = new []{ "Сыр моцарелла", "Соус \"Барбекю\"", "Соус \"Кальяри\"", "Пепперонни", "Овощи гриль", "Бекон", "Ветчина", "Томаты черри", "Шампиньоны" },
    sizes = new []{ "30 см", "40 см", "60 см" },
    crust = "Традиционное Толстое",
    price = 695m,
    weight = "980g"
},
    new {
        name = "XXXL",
    image = "../img/xxxl_2s.jpg",
    composition = new []{ "Cыр моцарелла", "Соус \"1000\"", "Куриный рулет", "Ветчина", "Колбаски охотничьи", "Бекон", "Сервелат", "Огурцы маринованные", "Томаты черри", "Маслины", "Лук маринованный" },
    sizes = new []{ "30 см", "40 см", "60 см" },
    crust = "Традиционное Толстое",
    price = 570m,
    weight = "740g"
    },
    new {
        name = "4 вкуса",
        image = "../img/4_vkusa_2s.jpg",
    composition = new []{ "Соус \"1000 островов\"", "Сыр моцарелла", "Рулет куриный", "Ветчина", "Пепперони", "Сыр пармезан", "Шампиньоны", "Томаты свежие", "Маслины/Оливки" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное Толстое",
        price = 495m,
        weight = "540g"
},
        new {
            name = "Амазонка",
            image = "../img/amazonka_2s.jpg",
    composition = new []{ "Соус \"Томатный\"", "Сыр моцарелла", "Куриная грудка", "Брокколи", "Огурцы маринованные", "Перец болгарский", "Шампиньоны", "Томаты черри", "Маслины", "Лук маринованный" },
    sizes = new []{ "30 см", "40 см", "60 см" },
            crust = "Традиционное Толстое",
            price = 515m,
            weight = "600g"
},
    new {
        name = "БананZZа",
        image = "../img/bananzza_2s.jpg",
    composition = new []{ "Бананы", "Соус \"Гавайский\"", "Сыр моцарелла", "Ананас", "Шоколад молочный", "Кокос/миндаль", "Топпинг клубничный" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное Толстое",
        price = 495m,
        weight = "520g"
},
    new {
        name = "Барбекю",
        image = "../img/barbeq_2s.jpg",
    composition = new []{ "Соус \"Томатный\"", "Сыр моцарелла", "Ветчина", "Бекон", "Пепперони", "Соус \"Барбекю\"", "Томаты", "Перец болгарский", "Лук маринованный" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное Толстое",
        price = 535m,
        weight = "590g"
},
    new {
        name = "Гавайская",
        image = "../img/hawai_2s.jpg",
    composition = new []{ "Ветчина", "Соус \"Гавайский\"", "Сыр моцарелла", "Ананас", "Перец болгарский" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное Толстое",
        price = 495m,
        weight = "550g"
},
    new {
        name = "Гавайская Premium",
        image = "../img/hawai_premium_2s.jpg",
    composition = new []{ "Соус \"Гавайский\"", "Сыр моцарелла", "Ананас", "Ветчина", "Куриный рулет", "Кукуруза", "Перец болгарский" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное Толстое",
        price = 515m,
        weight = "590g"
},
    new {
        name = "Греческая",
        image = "../img/grek_2s.jpg",
    composition = new []{ "Соус \"Кальяри\"", "Сыр моцарелла", "Сливочный сыр", "Брокколи", "Томаты черри", "Перец болгарский", "Маслины" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное Толстое",
        price = 525m,
        weight = "570g"
},
    new {
        name = "Грибная",
        image = "../img/gribnaya_2s.jpg",
    composition = new []{ "Соус \"Грибной\"", "Сыр моцарелла", "Опята маринованные", "Укроп", "Шампиньоны", "Лук маринованный" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное Толстое",
        price = 495m,
        weight = "550g"
},
    new {
        name = "Деревенская",
        image = "../img/derevenskaya_2s.jpg",
    composition = new []{ "Соус '1000 островов'", "Сыр моцарелла", "Ветчина", "Сервелат", "Огурцы маринованные", "Опята маринованные", "Укроп", "Лук маринованный" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 500m,
        weight = "560 г"
},
    new {
        name = "Домашняя",
        image = "../img/domashnyaya_2s.jpg",
    composition = new []{ "Соус 'Томатный'", "Сыр моцарелла", "Ветчина", "Сервелат", "Томаты", "Шампиньоны" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 515m,
        weight = "510 г"
},
    new {
        name = "Дон Бекон",
        image = "../img/don_bekon_2s.jpg",
    composition = new []{ "Бекон", "Соус 'Кальяри'", "Сыр моцарелла", "Томаты черри" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 515m,
        weight = "550 г"
},
    new {
        name = "Дьябло",
        image = "../img/diabolo_2s.jpg",
    composition = new []{ "Соус 'Томатный'", "Сыр моцарелла", "Ветчина", "Пепперони", "Соус 'Кимчи'", "Халапеньо", "Томаты" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 525m,
        weight = "560 г"
},
    new {
        name = "Кальяри",
        image = "../img/novogodnyaya_2s.jpg",
    composition = new []{ "Соус 'Кальяри'", "Креветки тигровые", "Куриная грудка", "Сыр моцарелла", "Ананас", "Соус 'Унаги'", "Кунжут" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 540m,
        weight = "560 г"
},
    new {
        name = "Колизей",
        image = "../img/kolizey_2s.jpg",
    composition = new []{ "Соус 'Горчичный'", "Сыр моцарелла", "Куринный рулет", "Колбаски охотничьи", "Соус 'Кисло-сладкий'", "Томаты свежие", "Лук маринованный" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 525m,
        weight = "660 г"
},
    new {
        name = "Королевская",
        image = "../img/korolevskaya_2.jpg",
    composition = new []{ "Соус 'Кальяри'", "Сыр моцарелла", "Бекон", "Креветки тигровые", "Сыр пармезан", "Томаты черри" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 610m,
        weight = "580 г"
},
    new {
        name = "Крестьянская",
        image = "../img/krestyanskaya_2s.jpg",
    composition = new []{ "Соус '1000 островов'", "Сыр моцарелла", "Бекон", "Укроп", "Томаты", "Шампиньоны", "Лук маринованный" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 500m,
        weight = "585 г"
},
    new {
        name = "Маргарита",
        image = "../img/margarita_2s.jpg",
    composition = new []{ "Соус 'Томатный'", "Сыр моцарелла", "Сливочный сыр", "Томаты черри" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 495m,
        weight = "460 г"
},
    new {
        name = "Морская",
        image = "../img/morskaya_2s.jpg",
    composition = new []{ "Соус 'Кальяри'", "Сыр моцарелла", "Кальмар", "Креветки тигровые", "Мидии", "Осьминог", "Лимон", "Укроп", "Лук маринованный", "Маслины" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 570m,
        weight = "550 г"
},
    new {
        name = "Мясная сборная",
        image = "../img/myasnaya_sbornaya_2s.jpg",
    composition = new []{ "Соус 'Барбекю'", "Сыр моцарелла", "Куриный рулет", "Ветчина", "Бекон", "Сервелат", "Томаты", "Перец болгарский", "Лук маринованный", "Маслины" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 540m,
        weight = "510 г"
},
    new {
        name = "Остров пепперони",
        image = "../img/ostrov_pepperoni_2s.jpg",
    composition = new []{ "Сыр моцарелла", "Соус '1000 островов'", "Пепперони", "Томаты свежие" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 515m,
        weight = "нет данных"
},
    new {
        name = "Охотничья",
        image = "../img/ohotnichya_2s.jpg",
    composition = new []{ "Соус '1000 островов'", "Сыр моцарелла", "Сервелат", "Бекон", "Колбаски охотничьи", "Сливочный сыр", "Сыр пармезан", "Томаты черри", "Лук маринованный", "Маслины" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 535m,
        weight = "560 г"
},
    new {
        name = "Пепперони",
        image = "../img/peperoni_2s.jpg",
    composition = new []{ "Соус 'Томатный'", "Сыр моцарелла", "Пепперони" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 475m,
        weight = "410 г"
},
    new {
        name = "Пикантная",
        image = "../img/pikantnaya_2s.jpg",
    composition = new []{ "Соус 'Кальяри'", "Ветчина", "Сливочный сыр", "Сыр пармезан", "Томаты свежие", "Перец болгарский" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 525m,
        weight = "510 г"
},
    new {
        name = "Поноккио",
        image = "../img/pinokio_2s.jpg",
    composition = new []{ "Соус 'Гавайский'", "Куриный рулет", "Сыр моцарелла", "Кукуруза" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 485m,
        weight = "510 г"
},
    new {
        name = "Пицца-Cezer",
        image = "../img/cezar_2s.jpg",
    composition = new []{ "Ветчина", "Куриная грудка", "Соус 'Кальяри'", "Сыр моцарелла", "Салат айсберг", "Сыр пармезан", "Соус 'Спайси'" },
        sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 525m,
        weight = "640 г"
},
    new {
        name = "Пицца-бургер",
        image = "../img/burger_2s.jpg",
    composition = new []{ "Соус 'Томатный'", "Сыр моцарелла", "Куриный рулет", "Ветчина", "Соус 'Бургер'", "Сервелат", "Кунжут", "Перец болгарский" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 515m,
        weight = "570 г"
},
    new {
        name = "Сардиния",
        image = "../img/novogodnyaya_2s.jpg",
    composition = new []{ "Соус 'Кальяри'", "Сыр моцарелла", "Брокколи", "Сливочный сыр", "Креветки тигровые", "Томаты черри" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 550m,
        weight = "520 г"
},
    new {
        name = "Славянская",
        image = "../img/slavyanskaya_2s.jpg",
    composition = new []{ "Соус '1000 островов'", "Сыр моцарелла", "Картофельные дольки", "Бекон", "Ветчина", "Огурцы маринованные", "Лук маринованный", "Зелень", "Томаты свежие" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 515m,
        weight = "560 г"
},
    new {
        name = "Сладкая Италия",
        image = "../img/novogodnyaya_2s.jpg",
    composition = new []{ "Соус 'Сливочный'", "Груша консервированная", "Сыр моцарелла", "Сыр с голубой плесенью", "Орехи грецкие", "Мёд натуральный" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 570m,
        weight = "530 г"
},
    new {
        name = "Сливочно-острая",
        image = "../img/slivochno_ostraya_2s.jpg",
    composition = new []{ "Соус '1000 островов'", "Сыр моцарелла", "Сервелат", "Бекон", "Сливочный сыр", "Соус 'Кимчи'", "Халапеньо", "Томаты" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 515m,
        weight = "580 г"
},
    new {
        name = "Солянка",
        image = "../img/solanka_2s.jpg",
    composition = new []{ "Соус 'Барбекю'", "Сыр моцарелла", "Колбаски охотничьи", "Бекон", "Сервелат", "Огурцы маринованные", "Лимон", "Укроп", "Томаты черри", "Лук маринованный", "Маслины" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 550m,
        weight = "600 г"
},
    new {
        name = "Сырная",
        image = "../img/cheese_2s.jpg",
    composition = new []{ "Сыр моцарелла", "Сливочный сыр", "Соус 'Кальяри'", "Сыр фетаки", "Сыр с голубой плесенью", "Сыр пармезан" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 570m,
        weight = "550 г"
},
    new {
        name = "Татарская",
        image = "../img/tatarskaya_2s.jpg",
    composition = new []{ "Соус 'Томатный'", "Куриный рулет", "Сыр моцарелла", "Конно-говяжья колбаса", "Лук маринованный", "Томаты", "Шампиньоны", "Перец болгарский" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 555m,
        weight = "580 г"
},
    new {
        name = "Фиеста",
        image = "../img/fiesta_2s.jpg",
    composition = new []{ "Соус '1000 островов'", "Сыр моцарелла", "Куриный рулет", "Колбаски охотничьи", "Сливочный сыр", "Сервелат", "Опята маринованные", "Шампиньоны" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 535m,
        weight = "580 г"
},
    new {
        name = "Филадельфия",
        image = "../img/filadelf_2s.jpg",
    composition = new []{ "Соус 'Кальяри'", "Сыр моцарелла", "Лосось", "Сливочный сыр", "Авокадо" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 600m,
        weight = "510 г"
},
    new {
        name = "Цезарь с лососем",
        image = "../img/cezar_s_lososem_2s.jpg",
    composition = new []{ "Сыр моцарелла", "Соус 'Кальяри'", "Свежие томаты", "Лосось", "Салат айсберг", "Соус 'Спайси'", "Сыр пармезан" },
    sizes = new []{ "30 см", "40 см", "60 см" },
        crust = "Традиционное толстое",
        price = 600m,
        weight = "550 г"
}
            };
        }
    }
}